app/Helpers/ActivityHelper.php

insert into `activity_logs` (`user_id`, `dosen_id`, `action`, `module`, `description`, `ip_address`, `user_agent`, `url`, `method`, `request_data`) values (1, null, 'logout', 'auth', 'User Administrator logout dari sistem', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/148.0.0.0 Safari/537.36', 'http://127.0.0.1:8000/logout', 'POST', null)
---
    public static function log($action, $module, $description, $data = null)
    {
        $user = Auth::user();

        return ActivityLog::create([
            'user_id' => $user ? $user->id : null,
            'dosen_id' => $user && $user->dosen_id ? $user->dosen_id : null,
            'action' => $action,
            'module' => $module,
            'description' => $description,
            'ip_address' => Request::ip(),
            'user_agent' => Request::userAgent(),
            'url' => Request::fullUrl(),
            'method' => Request::method(),
            'request_data' => $data,
        ]);