app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `dosens`
select count(*) as aggregate from `pengajaran`
select `bidang_keilmuan`, count(*) as total from `pengajaran` group by `bidang_keilmuan`
select `dosens`.*, (select count(*) from `pengajaran` where `dosens`.`id` = `pengajaran`.`dosen_id`) as `pengajarans_count` from `dosens` order by `pengajarans_count` desc limit 5
---
    public function index()
    {
        // Get current active period
        $currentPeriod = AcademicPeriod::current()->first();

        // Stats
        $stats = [
            'total_dosen' => Dosen::count(),
            'total_pengajaran' => Pengajaran::count(),
            'total_riset' => Riset::count(),
            'total_pkm' => Pkm::count(),
        ];

        // Teaching distribution by field
        $teachingByField = Pengajaran::select('bidang_keilmuan', DB::raw('count(*) as total'))
            ->groupBy('bidang_keilmuan')
            ->get();

        // Research grants by status
        $researchByStatus = Riset::select('status', DB::raw('count(*) as total'))
            ->groupBy('status')
            ->get();

        // Top 5 lecturers by teaching load
        $topLecturers = Dosen::withCount('pengajarans')
            ->orderBy('pengajarans_count', 'desc')
            ->limit(5)
            ->get();

select `sks`, count(*) as total from `pengajaran` group by `sks` order by `sks` asc
---
            ->get();

        // Chart data for SKS distribution
        $sksDistribution = Pengajaran::select('sks', DB::raw('count(*) as total'))
            ->groupBy('sks')
            ->orderBy('sks')
            ->get();