app/Http/Controllers/Admin/DosenController.php

select * from `dosens` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `dosens`
---
    public function index(Request $request)
    {
        $query = Dosen::query();

        if ($request->has('search') && $request->search) {
            $query->where('nama', 'like', '%' . $request->search . '%')
                ->orWhere('nidn', 'like', '%' . $request->search . '%')
                ->orWhere('nik', 'like', '%' . $request->search . '%')
                ->orWhere('email', 'like', '%' . $request->search . '%');
        }

        if ($request->has('status') && $request->status) {
            $query->where('status', $request->status);
        }

        $dosens = $query->latest()->paginate(10);