app/Http/Controllers/Admin/PeriodController.php

    public function index()
    {
        $periods = AcademicPeriod::orderBy('urutan', 'desc')->paginate(10);
---
select * from `academic_periods` order by `urutan` desc limit 10 offset 0
select count(*) as aggregate from `academic_periods`